wisteria-1c/Конфигурация/Catalogs/ВидыЗаказовПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыЗаказовПокупателей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьДоставку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСостоянияЗаявки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеДоставлен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеОжидаетОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеОтгружен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПорядокСостояний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/CommonForms/ФормаНастройкиФиксированныхСостоянийЗаказов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СохранитьГлобальныеНастройки();
	
	НесколькоВидовЗаказов = ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказовПокупателей");
	
	Если Параметры.Свойство("Заголовок") И НЕ ПустаяСтрока(Параметры.Заголовок) Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	Параметры.Свойство("ИмяРеквизита", ИмяРеквизита);
	
	Параметры.Свойство("Подсказка", Подсказка);
	Элементы.Подсказка.Заголовок = Подсказка;
	Элементы.Подсказка.Видимость = НЕ ПустаяСтрока(Подсказка);
	
	ЗаполнитьТаблицуИСоздатьЭлементы();
	УправлениеФормой();
	
	КлючСохраненияПоложенияОкна = "ОбщаяФорма.ФормаНастройкиФиксированныхСостоянийЗаказов."+Строка(Новый УникальныйИдентификатор);
	
	ВывестиБаннеры();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ЗакрытиеССохранением И ПустаяСтрока(ИмяРеквизита) Тогда
		Оповестить("ИзмененыФиксированныеСостоянияЗаказов", "НеНастроено");
	КонецЕсли; 	
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура Подключаемый_ИспользоватьДоставкуПриИзменении(Элемент)
	
	Для Каждого ДанныеСтроки Из ТаблицаСостояний Цикл
		ДанныеСтроки.НеИспользоватьДоставку = Не ДанныеСтроки.ИспользоватьДоставку;
	КонецЦикла;
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключемый_СостояниеПриИзменении(Элемент)
	
	Элемент.ЦветРамки = Новый Цвет;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ДанныеСохранены = ОКНаСервере();
	Если Не ДанныеСохранены Тогда
		Возврат;
	КонецЕсли;
	
	Оповестить("ИзмененыФиксированныеСостоянияЗаказов", ИмяРеквизита);
	ЗакрытиеССохранением = Истина;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВывестиБаннеры()
	
	Если ИмяРеквизита = "СостояниеОжидаетОтгрузки" Тогда
		
		Сообщение = НСтр("ru = 'Ожидает отгрузки — заказы с соответствующим состоянием будут попадать в Маршрутные листы;
		|Использовать доставку — для этого вида заказов покупателей механизмы автоматизации доставки будут включены.'");
		
	ИначеЕсли ИмяРеквизита = "СостояниеОтгружен" Тогда
		
		Сообщение = НСтр("ru = 'Отгружен — в это состояние переводятся заказы после создания документов отгрузки;
		|Использовать доставку — для этого вида заказов покупателей механизмы автоматизации доставки будут включены.'");
		
	ИначеЕсли ИмяРеквизита = "СостояниеДоставлен" Тогда
		
		Сообщение = НСтр("ru = 'Доставлен — в это состояние переводятся заказы после подтверждения исполнения доставки;
		|Использовать доставку — для этого вида заказов покупателей механизмы автоматизации доставки будут включены.'");
		
	Иначе
		
		Сообщение = НСтр("ru = 'Ожидает отгрузки — заказы с соответствующим состоянием будут попадать в Маршрутные листы;
		|Отгружен — в это состояние переводятся заказы после создания документов отгрузки;
		|Доставлен — в это состояние переводятся заказы после подтверждения исполнения доставки;
		|Использовать доставку — для этого вида заказов покупателей механизмы автоматизации доставки будут включены.'");
		
	КонецЕсли;
	
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Информация";
	ПараметрыВажногоСообщения.Сообщение = Сообщение;
	ПараметрыВажногоСообщения.КраткоеПредставление = НСтр("ru = 'Описание состояний доставки'");
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.Баннер);
	
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьГлобальныеНастройки()
	
	Это85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	ЭтоТакси = Не Это85;
	
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	
КонецПроцедуры

&НаСервере
Функция ОКНаСервере()
	
	Если НЕ РезультатПроверкиЗаполнения() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СохранитьИзменения();
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура УправлениеФормой()
	
	ПоказатьВсеТипыСостояний = Не ЗначениеЗаполнено(ИмяРеквизита);
	
	Элементы.ГруппаВидыЗаказов.Видимость = НесколькоВидовЗаказов И Не ЭтоМобильныйКлиент;
	Элементы.ГруппаСостоянияЗаказов.Видимость = Не НесколькоВидовЗаказов;
	Элементы.ГруппаВидыЗаказовМК.Видимость = ЭтоМобильныйКлиент;
	
	Элементы.ВидЗаказаЗаголовок.Видимость = ПоказатьВсеТипыСостояний;
	Элементы.ОжидаетОтгрузкиЗаголовок.Видимость = ПоказатьВсеТипыСостояний;
	Элементы.ОтгруженЗаголовок.Видимость = ПоказатьВсеТипыСостояний;
	Элементы.Доставлен.Видимость = ПоказатьВсеТипыСостояний;
	Элементы.ИспользоватьДоставкуПустойЗаголовок.Видимость = ПоказатьВсеТипыСостояний;
	
	УстановитьСвойстваСостоянийПоИспользованиюДоставки();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваСостоянийПоИспользованиюДоставки()
	
	Для Индекс = 0 По ТаблицаСостояний.Количество() - 1 Цикл
		
		ДанныеСостояния = ТаблицаСостояний[Индекс];
		НеИспользоватьДоставку = ДанныеСостояния.НеИспользоватьДоставку;
		
		Если НеИспользоватьДоставку Тогда
			ДанныеСостояния.СостояниеОжидаетОтгрузки = Неопределено;
			ДанныеСостояния.СостояниеОтгружен = Неопределено;
			ДанныеСостояния.СостояниеДоставлен = Неопределено;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИмяРеквизита) Тогда
			
			ТипСостояния = ТипСостоянияПоИмениРеквизита(ИмяРеквизита);
			УстановитьСвойстваСостоянияПоИспользованиюДоставки(ТипСостояния, Индекс, НеИспользоватьДоставку);
			
		Иначе
			
			Для Каждого ТипСостояния Из ТипыСостояний() Цикл
				УстановитьСвойстваСостоянияПоИспользованиюДоставки(ТипСостояния, Индекс, НеИспользоватьДоставку);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваСостоянияПоИспользованиюДоставки(ТипСостояния, Индекс, НеИспользоватьДоставку)
	
	НазваниеПоляСостояния = НазваниеПоляСостояния(ТипСостояния, Индекс);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы, НазваниеПоляСостояния, "Доступность", НЕ НеИспользоватьДоставку);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы, НазваниеПоляСостояния, "АвтоОтметкаНезаполненного", НЕ НеИспользоватьДоставку);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы, НазваниеПоляСостояния, "ОтметкаОбязательногоЗаполнения", НЕ НеИспользоватьДоставку);
	
	Элементы[НазваниеПоляСостояния].ЦветРамки = Новый Цвет;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуИСоздатьЭлементы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыЗаказовПокупателей.Ссылка КАК ВидЗаказа,
	|	ВидыЗаказовПокупателей.СостояниеДоставлен КАК СостояниеДоставлен,
	|	ВидыЗаказовПокупателей.СостояниеОтгружен КАК СостояниеОтгружен,
	|	ВидыЗаказовПокупателей.СостояниеОжидаетОтгрузки КАК СостояниеОжидаетОтгрузки,
	|	ВидыЗаказовПокупателей.НеИспользоватьДоставку КАК НеИспользоватьДоставку,
	|	ВидыЗаказовПокупателей.ПорядокСостояний.(
	|		Состояние КАК Состояние
	|	) КАК ПорядокСостояний,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВидыЗаказовПокупателей.Ссылка) КАК Представление
	|ИЗ
	|	Справочник.ВидыЗаказовПокупателей КАК ВидыЗаказовПокупателей
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыЗаказовПокупателей.Наименование";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Индекс = 0;
	Пока Выборка.Следующий() Цикл
		
		Если Не НесколькоВидовЗаказов И Выборка.ВидЗаказа <> Справочники.ВидыЗаказовПокупателей.Основной Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаСостояний.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.ИспользоватьДоставку = Не НоваяСтрока.НеИспользоватьДоставку;
		ПоляСостояний = Новый Массив;
		
		Если НесколькоВидовЗаказов Тогда
			
			Если ЭтоМобильныйКлиент Тогда
				СоздатьЭлементыДляВидовМК(Индекс, Выборка, ПоляСостояний)
			Иначе
				СоздатьЭлементыДляВидов(Индекс, Выборка, ПоляСостояний);
			КонецЕсли;
			
		Иначе
			
			Если ЗначениеЗаполнено(ИмяРеквизита) Тогда
				
				ТипСостояния = ТипСостоянияПоИмениРеквизита(ИмяРеквизита);
				ПолеСостояния = СоздатьЭлементПоляСостоянияБезВидов(ТипСостояния);
				ПоляСостояний.Добавить(ПолеСостояния);
				
			Иначе
				
				Для Каждого ТипСостояния Из ТипыСостояний() Цикл
					ПолеСостояния = СоздатьЭлементПоляСостоянияБезВидов(ТипСостояния);
					ПоляСостояний.Добавить(ПолеСостояния);
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ВыборкаСостояний = Выборка.ПорядокСостояний.Выбрать();
		Пока ВыборкаСостояний.Следующий() Цикл
			Для Каждого ПолеСостояния Из ПоляСостояний Цикл
				
				ПолеСостояния.СписокВыбора.Добавить(ВыборкаСостояний.Состояние);
				
			КонецЦикла;
		КонецЦикла;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыДляВидов(Индекс, Выборка, ПоляСостояний)
	
	НазваниеДекорацииВида = СтрШаблон("ДекорацияВидЗаказаЗаголовок_%1", Индекс);
	ДекорацияВидЗаказаЗаголовок = Элементы.Добавить(НазваниеДекорацииВида, Тип("ДекорацияФормы"), Элементы.КолонкаВидыСостояний);
	ДекорацияВидЗаказаЗаголовок.Вид = ВидДекорацииФормы.Надпись;
	ДекорацияВидЗаказаЗаголовок.Заголовок = Выборка.Представление + ":";
	
	Если ЗначениеЗаполнено(ИмяРеквизита) Тогда
		
		ТипСостояния = ТипСостоянияПоИмениРеквизита(ИмяРеквизита);
		ПолеСостояния = СоздатьЭлементПоляСостояния(ТипСостояния, Индекс);
		ПоляСостояний.Добавить(ПолеСостояния);
		
	Иначе
		
		Для Каждого ТипСостояния Из ТипыСостояний() Цикл
			ПолеСостояния = СоздатьЭлементПоляСостояния(ТипСостояния, Индекс);
			ПоляСостояний.Добавить(ПолеСостояния);
		КонецЦикла;
		
	КонецЕсли;
	
	НазваниеФлажка = СтрШаблон("Отключение_%1", Индекс);
	ФлажокИспользоватьДоставку = Элементы.Добавить(НазваниеФлажка, Тип("ПолеФормы"), Элементы.КолонкаИспользоватьДоставку);
	ФлажокИспользоватьДоставку.ПутьКДанным = СтрШаблон("ТаблицаСостояний[%1].ИспользоватьДоставку", Индекс);
	ФлажокИспользоватьДоставку.Вид = ВидПоляФормы.ПолеФлажка;
	ФлажокИспользоватьДоставку.ВидФлажка = ВидФлажка.Выключатель;
	ФлажокИспользоватьДоставку.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	ФлажокИспользоватьДоставку.УстановитьДействие("ПриИзменении", "Подключаемый_ИспользоватьДоставкуПриИзменении");
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыДляВидовМК(Индекс, Выборка, ПоляСостояний)
	
	НазваниеГруппы = СтрШаблон("ГруппаВидЗаказа%1", Выборка.Представление);
	ГруппаВидЗаказа = Элементы.Добавить(НазваниеГруппы, Тип("ГруппаФормы"), Элементы.ГруппаВидыЗаказовМК);
	ГруппаВидЗаказа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаВидЗаказа.ОтображатьЗаголовок = Истина;
	ГруппаВидЗаказа.Заголовок = Выборка.Представление;
	ГруппаВидЗаказа.ОтображатьКакКарточку = Истина;
	
	Если ЗначениеЗаполнено(ИмяРеквизита) Тогда
		
		ТипСостояния = ТипСостоянияПоИмениРеквизита(ИмяРеквизита);
		ПолеСостояния = СоздатьЭлементПоляСостояния(ТипСостояния, Индекс, ГруппаВидЗаказа);
		ПолеСостояния.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
		ПолеСостояния.Ширина = 0;
		ПоляСостояний.Добавить(ПолеСостояния);
		
	Иначе
		
		Для Каждого ТипСостояния Из ТипыСостояний() Цикл
			ПолеСостояния = СоздатьЭлементПоляСостояния(ТипСостояния, Индекс, ГруппаВидЗаказа);
			ПолеСостояния.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
			ПолеСостояния.Ширина = 0;
			ПоляСостояний.Добавить(ПолеСостояния);
		КонецЦикла;
		
	КонецЕсли;
	
	НазваниеФлажка = СтрШаблон("Отключение_%1", Индекс);
	ФлажокИспользоватьДоставку = Элементы.Добавить(НазваниеФлажка, Тип("ПолеФормы"), ГруппаВидЗаказа);
	ФлажокИспользоватьДоставку.ПутьКДанным = СтрШаблон("ТаблицаСостояний[%1].ИспользоватьДоставку", Индекс);
	ФлажокИспользоватьДоставку.Вид = ВидПоляФормы.ПолеФлажка;
	ФлажокИспользоватьДоставку.ВидФлажка = ВидФлажка.Выключатель;
	ФлажокИспользоватьДоставку.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	ФлажокИспользоватьДоставку.УстановитьДействие("ПриИзменении", "Подключаемый_ИспользоватьДоставкуПриИзменении");
	
КонецПроцедуры

&НаСервере
Функция СоздатьЭлементПоляСостояния(ТипСостояния, Индекс, Родитель = Неопределено)
	
	Если Родитель = Неопределено Тогда
		Родитель = Элементы["Колонка" + ТипСостояния];
	КонецЕсли;
	
	НазваниеПоляСостояния = НазваниеПоляСостояния(ТипСостояния, Индекс);
	Результат = Элементы.Добавить(НазваниеПоляСостояния, Тип("ПолеФормы"), Родитель);
	Результат.ПутьКДанным = СтрШаблон("ТаблицаСостояний[%1].Состояние%2", Индекс, ТипСостояния);
	Результат.Вид = ВидПоляФормы.ПолеВвода;
	Результат.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	Результат.РежимВыбораИзСписка = Истина;
	Результат.КнопкаОткрытия = Ложь;
	Результат.КнопкаСоздания = Ложь;
	Результат.Ширина = 15;
	Результат.УстановитьДействие("ПриИзменении", "Подключемый_СостояниеПриИзменении");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция НазваниеПоляСостояния(ТипСостояния, Индекс)
	
	Возврат СтрШаблон("ПолеСостояния%1_%2", ТипСостояния, Индекс);
	
КонецФункции

&НаСервере
Функция СоздатьЭлементПоляСостоянияБезВидов(ТипСостояния)
	
	НазваниеПоляСостояния = НазваниеПоляСостояния(ТипСостояния, 0);
	Результат = Элементы.Добавить(НазваниеПоляСостояния, Тип("ПолеФормы"), Элементы.ГруппаСостоянияЗаказов);
	Результат.ПутьКДанным = СтрШаблон("ТаблицаСостояний[0].Состояние%1", ТипСостояния);
	Результат.Вид = ВидПоляФормы.ПолеВвода;
	Результат.РежимВыбораИзСписка = Истина;
	Результат.КнопкаОткрытия = Ложь;
	Результат.КнопкаСоздания = Ложь;
	Результат.УстановитьДействие("ПриИзменении", "Подключемый_СостояниеПриИзменении");
	Результат.АвтоМаксимальнаяШирина = Ложь;
	Результат.МаксимальнаяШирина = 45;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяРеквизитаПоИндексу(Индекс)
	
	Если Индекс=1 Тогда
		Возврат "СостояниеОжидаетОтгрузки";
	ИначеЕсли Индекс=2 Тогда
		Возврат "СостояниеОтгружен";
	ИначеЕсли Индекс=3 Тогда
		Возврат "СостояниеДоставлен";
	КонецЕсли; 	
	
КонецФункции 

&НаСервере
Функция РезультатПроверкиЗаполнения()
	
	Отказ = Ложь;
	
	Для Индекс = 0 По ТаблицаСостояний.Количество() - 1 Цикл
		
		ДанныеСостояния = ТаблицаСостояний[Индекс];
		Если ДанныеСостояния.НеИспользоватьДоставку Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИмяРеквизита) Тогда
			
			ТипСостояния = ТипСостоянияПоИмениРеквизита(ИмяРеквизита);
			ПроверкаЗаполненияСостояния(ДанныеСостояния, ТипСостояния, Индекс, Отказ);
			
		Иначе
			
			Для Каждого ТипСостояния Из ТипыСостояний() Цикл
				ПроверкаЗаполненияСостояния(ДанныеСостояния, ТипСостояния, Индекс, Отказ);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НЕ Отказ;
	
КонецФункции

&НаСервере
Процедура ПроверкаЗаполненияСостояния(ДанныеСостояния, ТипСостояния, Индекс, Отказ)
	
	НазваниеРеквизита = СтрШаблон("Состояние%1", ТипСостояния);
	
	Если НЕ ЗначениеЗаполнено(ДанныеСостояния[НазваниеРеквизита]) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
		НСтр("ru = 'Укажите состояние заказа'"), , ,
		СтрШаблон("ТаблицаСостояний[%1].%2", Индекс, НазваниеРеквизита),
		Отказ);
		
		Если Не ЭтоТакси Тогда
			НазваниеПоляСостояния = НазваниеПоляСостояния(ТипСостояния, Индекс);
			Элементы[НазваниеПоляСостояния].ЦветРамки = ЦветаПалитры.Красный;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьИзменения()
	
	Если НесколькоВидовЗаказов Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СостоянияДоставки", ТаблицаСостояний.Выгрузить());
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СостоянияДоставки.ВидЗаказа,
		|	СостоянияДоставки.СостояниеДоставлен,
		|	СостоянияДоставки.СостояниеОтгружен,
		|	СостоянияДоставки.СостояниеОжидаетОтгрузки,
		|	СостоянияДоставки.НеИспользоватьДоставку
		|ПОМЕСТИТЬ СостоянияДоставки
		|ИЗ
		|	&СостоянияДоставки КАК СостоянияДоставки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СостоянияДоставки.ВидЗаказа,
		|	СостоянияДоставки.СостояниеОжидаетОтгрузки КАК Состояние
		|ПОМЕСТИТЬ ВидыЗаказыИСостояния
		|ИЗ
		|	СостоянияДоставки КАК СостоянияДоставки
		|ГДЕ
		|	НЕ СостоянияДоставки.НеИспользоватьДоставку
		|	И СостоянияДоставки.СостояниеОжидаетОтгрузки <> ЗНАЧЕНИЕ(Справочник.СостоянияЗаказовПокупателей.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СостоянияДоставки.ВидЗаказа,
		|	СостоянияДоставки.СостояниеОтгружен
		|ИЗ
		|	СостоянияДоставки КАК СостоянияДоставки
		|ГДЕ
		|	НЕ СостоянияДоставки.НеИспользоватьДоставку
		|	И СостоянияДоставки.СостояниеОтгружен <> ЗНАЧЕНИЕ(Справочник.СостоянияЗаказовПокупателей.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СостоянияДоставки.ВидЗаказа,
		|	СостоянияДоставки.СостояниеДоставлен
		|ИЗ
		|	СостоянияДоставки КАК СостоянияДоставки
		|ГДЕ
		|	НЕ СостоянияДоставки.НеИспользоватьДоставку
		|	И СостоянияДоставки.СостояниеДоставлен <> ЗНАЧЕНИЕ(Справочник.СостоянияЗаказовПокупателей.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыЗаказыИСостояния.ВидЗаказа КАК ВидЗаказа,
		|	ВидыЗаказыИСостояния.Состояние
		|ИЗ
		|	ВидыЗаказыИСостояния КАК ВидыЗаказыИСостояния
		|ГДЕ
		|	НЕ (ВидыЗаказыИСостояния.ВидЗаказа, ВидыЗаказыИСостояния.Состояние) В
		|				(ВЫБРАТЬ
		|					Справочник.ВидыЗаказовПокупателей.ПорядокСостояний.Ссылка,
		|					Справочник.ВидыЗаказовПокупателей.ПорядокСостояний.Состояние
		|				ИЗ
		|					Справочник.ВидыЗаказовПокупателей.ПорядокСостояний)
		|ИТОГИ ПО
		|	ВидЗаказа";
		ВыборкаВидыЗаказа = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаВидыЗаказа.Следующий() Цикл
			ВидЗаказаОбъект = ВыборкаВидыЗаказа.ВидЗаказа.ПолучитьОбъект();
			ВыборкаСостояния = ВыборкаВидыЗаказа.Выбрать();
			Пока ВыборкаСостояния.Следующий() Цикл
				НоваяСтрока = ВидЗаказаОбъект.ПорядокСостояний.Добавить();
				НоваяСтрока.Состояние = ВыборкаСостояния.Состояние;
			КонецЦикла;
			ВидЗаказаОбъект.Записать();
		КонецЦикла;
	КонецЕсли;
	
	Для каждого СтрокаТабличнойЧасти Из ТаблицаСостояний Цикл
		ВидЗаказа = СтрокаТабличнойЧасти.ВидЗаказа.ПолучитьОбъект();
		Изменен = Ложь;
		Если ПустаяСтрока(ИмяРеквизита) Тогда
			Для ии = 1 По 3 Цикл
				Имя = ИмяРеквизитаПоИндексу(ии);
				Если ВидЗаказа[Имя]=СтрокаТабличнойЧасти[Имя] Тогда
					Продолжить;
				КонецЕсли;
				Изменен = Истина;
				ВидЗаказа[Имя] = СтрокаТабличнойЧасти[Имя];
			КонецЦикла; 
		Иначе
			Если ВидЗаказа[ИмяРеквизита]<>СтрокаТабличнойЧасти[ИмяРеквизита] Тогда
				Изменен = Истина;
				ВидЗаказа[ИмяРеквизита] = СтрокаТабличнойЧасти[ИмяРеквизита];
			КонецЕсли; 
		КонецЕсли;
		Если НесколькоВидовЗаказов И ВидЗаказа.НеИспользоватьДоставку<>СтрокаТабличнойЧасти.НеИспользоватьДоставку Тогда
			Изменен = Истина;
			ВидЗаказа.НеИспользоватьДоставку = СтрокаТабличнойЧасти.НеИспользоватьДоставку;
			Если ВидЗаказа.НеИспользоватьДоставку Тогда
				ВидЗаказа.СостояниеДоставлен = Справочники.СостоянияЗаказовПокупателей.ПустаяСсылка();
				ВидЗаказа.СостояниеОтгружен = Справочники.СостоянияЗаказовПокупателей.ПустаяСсылка();
				ВидЗаказа.СостояниеОжидаетОтгрузки = Справочники.СостоянияЗаказовПокупателей.ПустаяСсылка();
			КонецЕсли; 
		КонецЕсли; 
		Если Изменен Тогда
			ВидЗаказа.Записать();
		КонецЕсли; 
	КонецЦикла; 	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ТипСостоянияПоИмениРеквизита(ИмяРеквизита)
	
	Если СтрНачинаетсяС(ИмяРеквизита, "Состояние") Тогда
		Возврат Сред(ИмяРеквизита, СтрДлина("Состояние") + 1);
	КонецЕсли;
	
	Возврат ИмяРеквизита;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипыСостояний()
	
	Результат = Новый Массив;
	Результат.Добавить("ОжидаетОтгрузки");
	Результат.Добавить("Отгружен");
	Результат.Добавить("Доставлен");
	Возврат Результат;
	
КонецФункции

#КонецОбласти
